{
	"version": "https://jsonfeed.org/version/1",
	"title": "C²'s Hidey Hole",
	"icon": "https://micro.blog/C2/avatar.jpg",
	"home_page_url": "https://www.sidpatchy.com/",
	"feed_url": "https://www.sidpatchy.com/feed.json",
	"items": [
		
			{
				"id": "http://sidpatchy.micro.blog/2024/03/07/110017.html",
				
				"content_html": "<!-- raw HTML omitted -->\n",
				"content_text": "\n\n<img src=\"uploads/2024/b9e21c417f.jpg\" width=\"600\" height=\"337\" alt=\"\">\n",
				"date_published": "2024-03-07T11:00:17-05:00",
				"url": "https://www.sidpatchy.com/2024/03/07/110017.html"
			},
			{
				"id": "http://sidpatchy.micro.blog/2024/02/13/street-signs-in.html",
				
				"content_html": "<p>Street signs in the middle of nowhere can be interesting subjects.</p>\n<p><!-- raw HTML omitted --><!-- raw HTML omitted --></p>\n",
				"content_text": "Street signs in the middle of nowhere can be interesting subjects.\n\n<img src=\"uploads/2024/dcb7e38003.jpg\" width=\"400\" height=\"600\" alt=\"\"><img src=\"uploads/2024/315fdae92f.jpg\" width=\"400\" height=\"600\" alt=\"\">\n",
				"date_published": "2024-02-13T11:03:00-05:00",
				"url": "https://www.sidpatchy.com/2024/02/13/street-signs-in.html"
			},
			{
				"id": "http://sidpatchy.micro.blog/2024/01/25/182944.html",
				
				"content_html": "<!-- raw HTML omitted -->\n",
				"content_text": "\n\n<img src=\"uploads/2024/8800776f1e.jpg\" width=\"600\" height=\"337\" alt=\"\">\n",
				"date_published": "2024-01-25T18:29:44-05:00",
				"url": "https://www.sidpatchy.com/2024/01/25/182944.html"
			},
			{
				"id": "http://sidpatchy.micro.blog/2024/01/01/202134.html",
				
				"content_html": "<p><!-- raw HTML omitted --><!-- raw HTML omitted --></p>\n",
				"content_text": "\n\n<img src=\"uploads/2024/9c05c8ea61.jpg\" width=\"400\" height=\"600\" alt=\"\"><img src=\"uploads/2024/e373590bf6.jpg\" width=\"600\" height=\"400\" alt=\"\">\n",
				"date_published": "2024-01-01T20:21:34-05:00",
				"url": "https://www.sidpatchy.com/2024/01/01/202134.html"
			},
			{
				"id": "http://sidpatchy.micro.blog/2023/12/31/202141.html",
				
				"content_html": "<!-- raw HTML omitted -->\n",
				"content_text": "\n\n<img src=\"uploads/2024/b34625a6a6.jpg\" width=\"600\" height=\"400\" alt=\"\">\n",
				"date_published": "2023-12-31T20:21:41-05:00",
				"url": "https://www.sidpatchy.com/2023/12/31/202141.html"
			},
			{
				"id": "http://sidpatchy.micro.blog/2023/12/24/a-photo-i.html",
				
				"content_html": "<p>A photo I took during a trip to Wyoming - dated 2023-06-15</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "A photo I took during a trip to Wyoming - dated 2023-06-15\n\n<img src=\"https://cdn.uploads.micro.blog/101940/2023/ced267a089.jpg\" width=\"600\" height=\"400\" alt=\"\">\n",
				"date_published": "2023-12-24T21:51:50-05:00",
				"url": "https://www.sidpatchy.com/2023/12/24/a-photo-i.html"
			},
			{
				"id": "http://sidpatchy.micro.blog/2023/12/24/214933.html",
				
				"content_html": "<!-- raw HTML omitted -->\n",
				"content_text": "\n\n<img src=\"https://cdn.uploads.micro.blog/101940/2023/638848c9d7.jpg\" width=\"600\" height=\"450\" alt=\"\">\n",
				"date_published": "2023-12-24T21:49:33-05:00",
				"url": "https://www.sidpatchy.com/2023/12/24/214933.html"
			},
			{
				"id": "http://sidpatchy.micro.blog/2023/09/18/093949.html",
				
				"content_html": "<!-- raw HTML omitted -->\n",
				"content_text": "\n\n<img src=\"https://cdn.uploads.micro.blog/101940/2023/351d8a4741.jpg\" width=\"600\" height=\"451\" alt=\"\">\n",
				"date_published": "2023-09-18T09:39:49-05:00",
				"url": "https://www.sidpatchy.com/2023/09/18/093949.html"
			},
			{
				"id": "http://sidpatchy.micro.blog/2023/09/05/looking-back-on.html",
				
				"content_html": "<p>Looking back on my trip to Wyoming last November, I have no regrets as to when I went.</p>\n<p>When I stopped at Devil&rsquo;s Tower, I only saw two people on the trail, which made it feel really cozy.</p>\n<p>It helped me appreciate and take in the environment, and made it that much more special for me.</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "Looking back on my trip to Wyoming last November, I have no regrets as to when I went.\n\nWhen I stopped at Devil's Tower, I only saw two people on the trail, which made it feel really cozy.\n\nIt helped me appreciate and take in the environment, and made it that much more special for me.\n\n<img src=\"https://cdn.uploads.micro.blog/101940/2023/5601072fd3.jpg\" width=\"600\" height=\"451\" alt=\"\">\n",
				"date_published": "2023-09-05T15:28:03-05:00",
				"url": "https://www.sidpatchy.com/2023/09/05/looking-back-on.html"
			},
			{
				"id": "http://sidpatchy.micro.blog/2023/09/03/193550.html",
				
				"content_html": "<!-- raw HTML omitted -->\n",
				"content_text": "\n\n<img src=\"https://cdn.uploads.micro.blog/101940/2023/8e877f1194.jpg\" width=\"451\" height=\"600\" alt=\"\">\n",
				"date_published": "2023-09-03T19:35:50-05:00",
				"url": "https://www.sidpatchy.com/2023/09/03/193550.html"
			},
			{
				"id": "http://sidpatchy.micro.blog/2023/08/11/161317.html",
				
				"content_html": "<!-- raw HTML omitted -->\n",
				"content_text": "\n\n<img src=\"https://cdn.uploads.micro.blog/101940/2023/image.jpg\" width=\"600\" height=\"400\" alt=\"\">\n",
				"date_published": "2023-08-11T16:13:17-05:00",
				"url": "https://www.sidpatchy.com/2023/08/11/161317.html"
			},
			{
				"id": "http://sidpatchy.micro.blog/2023/06/18/admitting-defeat.html",
				"title": "Admitting defeat.",
				"content_html": "<p>Smartphones are one of the most impactful items in our lives. For many people, they are able to (and do) entirely replace the personal computer. Just like everyone, I use my smartphone daily, whether it&rsquo;s for checking the news, for listening to music, or for interfacing with a multitude of bluetooth devices from earbuds to satellite communicators.</p>\n<p>My first smartphone was a Windows Phone, the Nokia Lumia 521 specifically, and honestly, Windows Phone is probably the best Microsoft product of the past few decades, far surpassing its desktop counterpart. It&rsquo;s my favourite mobile operating system to date. I even had the equally ill-fated Microsoft band, and if you&rsquo;ve seen my <a href=\"https://www.sidpatchy.com/2023/03/24/smartwatch-tier-list.html\">smartwatch tier list</a>, you&rsquo;ll know that I think it&rsquo;s one of the best smartwatches I&rsquo;ve ever used. Honestly, if it had replaceable bands and better fitness tracking, it&rsquo;d probably be number 1 or 2.</p>\n<p>Windows Phone isn&rsquo;t the focal point of this post, but taking a moment to admire and appreciate the beautiful consistency of the OS and ecosystem is vital to understand why I must finally admit defeat.</p>\n<p>Before and after Windows Phone, I used an iPod Touch (4th gen) and an iPad Mini (1st gen). They were the first and last Apple products I ever owned, and using them caused me to realize several problems I had with Apple&rsquo;s mobile ecosystem. These issues primarily fell into the category of &ldquo;lacking customization&rdquo; or &ldquo;too expensive.&rdquo;</p>\n<p>For many years, I have viewed the iPhone&rsquo;s complete distrust of the user as abominable. One thing I have a problem with to this day is the launcher (home screen). I think things should almost always be in a vertical ordered list. On my Pixel 7 Pro, I use Niagara Launcher, and it&rsquo;s a near perfect embodiment of how my ideal launcher works. You have one page with a few important apps, and then another with everything else sorted in alphabetical order. Windows Phone did this in a similar, but different way.</p>\n<p>Apple doesn&rsquo;t allow the user to make this choice. They don&rsquo;t even allow the user to align apps wherever they want them on the screen. Android does, and even if they don&rsquo;t most environments allow you to completely change the launcher. Unfortunately, it looks as though this peeve won&rsquo;t be resolved any time soon, <em>however</em>, as the years have passed, Apple has begun to allow users to hide apps and entire home screen pages, and locate those apps in the &ldquo;App Library.&rdquo; While still not ideal (I&rsquo;d kill for Niagara Launcher on iPhone), this, for the most part, solves my biggest problem with the home screen of many iPhones I&rsquo;ve used over the years: clutter.</p>\n<p>This brings us to Focus Modes. If you&rsquo;re unaware, Focus Modes allow users to &ldquo;stay in the moment&rdquo; by controlling when (and if) notifications, home screen pages, and more are seen. These can be automated based on a number of factors.</p>\n<p>Focus Modes are one of the killer features that I hoped would reach Android within a generation or two, but that has yet to happen. The closest I received on my Pixel 7 Pro was &ldquo;Rules&rdquo; which basically allow for automatically changing whether the phone is on silent, vibrate, or ring. I have no utility for this, as my phone is constantly on vibrate, but the framework for something similar is there. Google just clearly doesn&rsquo;t care to implement anything else.</p>\n<p>Finally, as someone who has working memory issues, I misplace things ALL THE TIME. For years, I&rsquo;ve looked at Tile as a relatively viable solution to this problem. However, Tile has never had a great system, nor are they very reliable in the tracking department. Despite this, I&rsquo;d always considered them, that was until Tile was purchased by Life360, a company that I personally do not trust near anything I own.</p>\n<p>Enter the Find My network and AirTags. These are what Tile could&rsquo;ve been. They actually work.</p>\n<p>In general, Apple has opened up more, while Google and Android have slowly gotten more and more locked down. The only major problem I still have with iPhone is the lack of USB-C. That&rsquo;s it, and it&rsquo;s looking like that&rsquo;s going to be solved with the iPhone 15.</p>\n<p>USB-C has been a game-changer for me. When I travel, I only bring one cable as long as my trip is less than 14 days. I can use one charger for my phone, laptop, a multitude of cameras and microphones, my Garmin inReach device, and so much more.  USB-C has firmly planted itself as <em><strong>the</strong></em> DC power and data transfer standard, and it&rsquo;s beyond glorious to live in the world of only <em>needing</em> one cable.</p>\n<p>With my hesitations surrounding the iPhone slowly being squashed, I can&rsquo;t ignore the draw of the convenience and security that the iPhone offers anymore. It&rsquo;s undeniable that the iPhone provides an all-around solid and reliable experience, even if it doesn&rsquo;t allow as much customization as Android. It&rsquo;s a trade-off, but I believe it&rsquo;s one worth making.</p>\n<p>One day I realized that despite the fact that I&rsquo;ve long championed Android, I can&rsquo;t just keep sitting here hoping that Google will adopt the features I&rsquo;m metaphorically drooling over. That&rsquo;s when I made the decision. I have to admit defeat. It&rsquo;s bittersweet. Android has long served me well, but it&rsquo;s time for me to move on.</p>\n<p>I won&rsquo;t forget the freedom of customization that Android granted me, the kind of liberty that made my device truly mine. But times change, and as technology moves forward, we must adapt. That’s exactly what I intend to do.</p>\n<p>So yes, I admit defeat. Not because I no longer value the principles and features that once endeared Android to me, but because the world of technology is never stagnant and to continue thriving in it, one must keep moving, exploring new horizons and embracing change. And that&rsquo;s what I am doing - embracing the iPhone and Apple&rsquo;s ecosystem.</p>\n<p>This isn&rsquo;t a goodbye to Android. It will always hold a special place in my heart, and who knows? Maybe one day, if the winds of technology shift yet again, I&rsquo;ll find myself back with an Android device in my pocket. But until that day, I am ready to start a new chapter in my digital life, ready to explore all the possibilities that Apple has to offer.</p>\n<p>So, I&rsquo;m pronouncing it here: if iPhone 15 embraces USB-C, I will embrace it.</p>\n",
				"content_text": "Smartphones are one of the most impactful items in our lives. For many people, they are able to (and do) entirely replace the personal computer. Just like everyone, I use my smartphone daily, whether it's for checking the news, for listening to music, or for interfacing with a multitude of bluetooth devices from earbuds to satellite communicators.\n\nMy first smartphone was a Windows Phone, the Nokia Lumia 521 specifically, and honestly, Windows Phone is probably the best Microsoft product of the past few decades, far surpassing its desktop counterpart. It's my favourite mobile operating system to date. I even had the equally ill-fated Microsoft band, and if you've seen my [smartwatch tier list](https://www.sidpatchy.com/2023/03/24/smartwatch-tier-list.html), you'll know that I think it's one of the best smartwatches I've ever used. Honestly, if it had replaceable bands and better fitness tracking, it'd probably be number 1 or 2. \n\nWindows Phone isn't the focal point of this post, but taking a moment to admire and appreciate the beautiful consistency of the OS and ecosystem is vital to understand why I must finally admit defeat.\n\nBefore and after Windows Phone, I used an iPod Touch (4th gen) and an iPad Mini (1st gen). They were the first and last Apple products I ever owned, and using them caused me to realize several problems I had with Apple's mobile ecosystem. These issues primarily fell into the category of \"lacking customization\" or \"too expensive.\"\n\nFor many years, I have viewed the iPhone's complete distrust of the user as abominable. One thing I have a problem with to this day is the launcher (home screen). I think things should almost always be in a vertical ordered list. On my Pixel 7 Pro, I use Niagara Launcher, and it's a near perfect embodiment of how my ideal launcher works. You have one page with a few important apps, and then another with everything else sorted in alphabetical order. Windows Phone did this in a similar, but different way.\n\nApple doesn't allow the user to make this choice. They don't even allow the user to align apps wherever they want them on the screen. Android does, and even if they don't most environments allow you to completely change the launcher. Unfortunately, it looks as though this peeve won't be resolved any time soon, *however*, as the years have passed, Apple has begun to allow users to hide apps and entire home screen pages, and locate those apps in the \"App Library.\" While still not ideal (I'd kill for Niagara Launcher on iPhone), this, for the most part, solves my biggest problem with the home screen of many iPhones I've used over the years: clutter.\n\nThis brings us to Focus Modes. If you're unaware, Focus Modes allow users to \"stay in the moment\" by controlling when (and if) notifications, home screen pages, and more are seen. These can be automated based on a number of factors.\n\nFocus Modes are one of the killer features that I hoped would reach Android within a generation or two, but that has yet to happen. The closest I received on my Pixel 7 Pro was \"Rules\" which basically allow for automatically changing whether the phone is on silent, vibrate, or ring. I have no utility for this, as my phone is constantly on vibrate, but the framework for something similar is there. Google just clearly doesn't care to implement anything else.\n\nFinally, as someone who has working memory issues, I misplace things ALL THE TIME. For years, I've looked at Tile as a relatively viable solution to this problem. However, Tile has never had a great system, nor are they very reliable in the tracking department. Despite this, I'd always considered them, that was until Tile was purchased by Life360, a company that I personally do not trust near anything I own.\n\nEnter the Find My network and AirTags. These are what Tile could've been. They actually work.\n\nIn general, Apple has opened up more, while Google and Android have slowly gotten more and more locked down. The only major problem I still have with iPhone is the lack of USB-C. That's it, and it's looking like that's going to be solved with the iPhone 15.\n\nUSB-C has been a game-changer for me. When I travel, I only bring one cable as long as my trip is less than 14 days. I can use one charger for my phone, laptop, a multitude of cameras and microphones, my Garmin inReach device, and so much more.  USB-C has firmly planted itself as ***the*** DC power and data transfer standard, and it's beyond glorious to live in the world of only *needing* one cable.\n\nWith my hesitations surrounding the iPhone slowly being squashed, I can't ignore the draw of the convenience and security that the iPhone offers anymore. It's undeniable that the iPhone provides an all-around solid and reliable experience, even if it doesn't allow as much customization as Android. It's a trade-off, but I believe it's one worth making.\n\nOne day I realized that despite the fact that I've long championed Android, I can't just keep sitting here hoping that Google will adopt the features I'm metaphorically drooling over. That's when I made the decision. I have to admit defeat. It's bittersweet. Android has long served me well, but it's time for me to move on.\n\nI won't forget the freedom of customization that Android granted me, the kind of liberty that made my device truly mine. But times change, and as technology moves forward, we must adapt. That’s exactly what I intend to do.\n\nSo yes, I admit defeat. Not because I no longer value the principles and features that once endeared Android to me, but because the world of technology is never stagnant and to continue thriving in it, one must keep moving, exploring new horizons and embracing change. And that's what I am doing - embracing the iPhone and Apple's ecosystem.\n\nThis isn't a goodbye to Android. It will always hold a special place in my heart, and who knows? Maybe one day, if the winds of technology shift yet again, I'll find myself back with an Android device in my pocket. But until that day, I am ready to start a new chapter in my digital life, ready to explore all the possibilities that Apple has to offer.\n\nSo, I'm pronouncing it here: if iPhone 15 embraces USB-C, I will embrace it.\n",
				"date_published": "2023-06-18T22:58:59-05:00",
				"url": "https://www.sidpatchy.com/2023/06/18/admitting-defeat.html"
			},
			{
				"id": "http://sidpatchy.micro.blog/2023/06/04/the-mighty-mississippi.html",
				
				"content_html": "<p>The mighty Mississippi, bent to the whims of mankind.</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "The mighty Mississippi, bent to the whims of mankind.\n\n<img src=\"https://cdn.uploads.micro.blog/101940/2023/887551cafb.jpg\" width=\"600\" height=\"451\" alt=\"\">\n",
				"date_published": "2023-06-04T08:44:43-05:00",
				"url": "https://www.sidpatchy.com/2023/06/04/the-mighty-mississippi.html"
			},
			{
				"id": "http://sidpatchy.micro.blog/2023/04/27/found-a-new.html",
				
				"content_html": "<p>Found a new (to me) park today. It was a very interesting, albeit windy, hike.</p>\n<p><!-- raw HTML omitted --><!-- raw HTML omitted --></p>\n",
				"content_text": "Found a new (to me) park today. It was a very interesting, albeit windy, hike.\n\n<img src=\"https://cdn.uploads.micro.blog/101940/2023/607bd93eb5.jpg\" width=\"600\" height=\"451\" alt=\"\"><img src=\"https://cdn.uploads.micro.blog/101940/2023/f5263f895c.jpg\" width=\"451\" height=\"600\" alt=\"\">\n",
				"date_published": "2023-04-27T23:12:16-05:00",
				"url": "https://www.sidpatchy.com/2023/04/27/found-a-new.html"
			},
			{
				"id": "http://sidpatchy.micro.blog/2023/04/20/removing-the-human.html",
				"title": "Removing The Human Factor",
				"content_html": "<blockquote>\n<p><em>(Note from C²: This post contains no AI generated content. Except for the part where I use square brackets around &ldquo;er&rdquo;, I wasn&rsquo;t sure about how to properly format that as I usually try to avoid tangents [like this] in my writing.)</em></p>\n</blockquote>\n<p>Humans are faulty by nature. Even the greatest minds on our planet today make errors. This is a well-known fact.</p>\n<p>The recent eruption of AI has caused me to gain an entirely new view on the human factor and the ethics of removing it.</p>\n<p>For as long as I can remember, I have thought that humans were irreplaceable creatures. I believed that there are some things that a machine should <em>never</em> do. Machines are (presently) not able to consider things in the same way a human is. They lack a sense of judgement. Even if a human tried to program a machine to judge one simple task, you end up in an endless loop of &ldquo;what-ifs.&rdquo; Let&rsquo;s take a machine tasked with judging whether a person should be ticketed for speeding.</p>\n<p>One may start by defining a system that writes a ticket if the driver is 5 miles per hour over the speed limit. But then the question of what if the driver is in an emergency arises. We inevitably have to ask what constitutes an emergency. What if your wife is wounded badly and you rushed her in your car instead of calling an ambulance (this is a sadly frequent occurrence because ambulances are PROHIBITIVELY EXPENSIVE in the U.S.A.)? Does it count as a traffic violation since you disregarded the proper avenues? Either way, there are likely some situations we&rsquo;d want to consider this further. Every situation we add adds an infinitely complex series of questions that <em>need</em> answers in order to achieve autonomy. A machine simply cannot be created to do this. It needs to be able to empathize with humans.</p>\n<p>Empathy is an important skill. Not all people are great at it, some people who lack the ability to empathize view that as a strength, and further view those who can empathize as being weak. Ultimately, I will argue that the ability to empathize with one another, and the world around us is what ultimately separates us from machines. However, due to the nature of empathy, it is almost impossible to quantitate. An individual simply cannot define their own sense of empathy, let alone try to measure or describe someone else&rsquo;s.</p>\n<p>I once fell in the camp of viewing empathy as a weakness. However, as I have learned more about the world, I have began to understand how flawed that view is. Changing your mind is hard, and oftentimes we don&rsquo;t even realize we&rsquo;ve done it until we sit down to write a blog post that briefly discusses the topic at hand.</p>\n<p>After playing around with ChatGPT and the like, I began to change my mind once again. I&rsquo;ve felt as though I&rsquo;ve been very aware of the process and my change in mindset. It first started as, the thought of how great it will be to replace mundane and unethical jobs.</p>\n<blockquote>\n<p><em>(Note from C²: I realize this is going to be considered a hot-take by many, but work in retail for 2 days, especially as a woman, and realize that this is the unbridled truth)</em></p>\n</blockquote>\n<p>The fact that retail workers still exist to the extent that they do is unethical. The mere fact that customers and managers exist who are allowed to harass innocent employees to no end is quite frankly disgusting, and wholly unethical. The fact that we as a society generally don&rsquo;t see the need to take immediate action against (primarily) men harassing (especially in the case of young[er]) women (especially, but not limited to) verbally is horrifying.</p>\n<p>It&rsquo;s disgusting and abhorrent that some men objectify women and discuss parts of them with others, regardless of their gender. If you so much as dare to not reciprocate this behaviour, or engage in it, you&rsquo;re quickly shunned. I&rsquo;ve flat out been told on multiple occasions that it&rsquo;s &ldquo;not cool&rdquo; to act in a manner that doesn&rsquo;t objectify women into mere sex trophies.</p>\n<p>This inevitably brings me to the desire to &ldquo;remove the human factor&rdquo; for all the wrong reasons. I had begun writing this intending to conclude that I want to &ldquo;remove the human factor&rdquo; for situations like driving, where thousands of people are needlessly <em>murdered</em> each year by negligence on behalf of themselves, others, and their governments.</p>\n<p>However, I now realize that I have some deep desire to escape from contact with the general public (I strongly believe) due to my experiences working in retail, and furthering that goal is something that &ldquo;removing the human factor&rdquo; will probably achieve. It seems my brain has once again played tricks on me to downplay my (admittedly relatively minor) traumas.</p>\n<p>I&rsquo;d normally try to write a &ldquo;proper&rdquo; conclusion here, but this post has evolved from an attempt to document my thoughts into a realization that I can&rsquo;t fully grasp the reasoning behind any of my thoughts, but now I&rsquo;m having an existential crisis and want to go to bed, so I will.</p>\n<blockquote>\n<p><em>(Note from C²: I feel like this ending has made me come off as one of those psychopaths that think humans need to go extinct. I don&rsquo;t believe that and that belief couldn&rsquo;t be further from the truth if it tried to be. I simply have the desire to hide away from society for a while.)</em></p>\n</blockquote>\n<p>-C²</p>\n",
				"content_text": "> *(Note from C²: This post contains no AI generated content. Except for the part where I use square brackets around \"er\", I wasn't sure about how to properly format that as I usually try to avoid tangents [like this] in my writing.)*\r\n\r\nHumans are faulty by nature. Even the greatest minds on our planet today make errors. This is a well-known fact. \r\n\r\nThe recent eruption of AI has caused me to gain an entirely new view on the human factor and the ethics of removing it.\r\n\r\nFor as long as I can remember, I have thought that humans were irreplaceable creatures. I believed that there are some things that a machine should *never* do. Machines are (presently) not able to consider things in the same way a human is. They lack a sense of judgement. Even if a human tried to program a machine to judge one simple task, you end up in an endless loop of \"what-ifs.\" Let's take a machine tasked with judging whether a person should be ticketed for speeding.\r\n\r\nOne may start by defining a system that writes a ticket if the driver is 5 miles per hour over the speed limit. But then the question of what if the driver is in an emergency arises. We inevitably have to ask what constitutes an emergency. What if your wife is wounded badly and you rushed her in your car instead of calling an ambulance (this is a sadly frequent occurrence because ambulances are PROHIBITIVELY EXPENSIVE in the U.S.A.)? Does it count as a traffic violation since you disregarded the proper avenues? Either way, there are likely some situations we'd want to consider this further. Every situation we add adds an infinitely complex series of questions that *need* answers in order to achieve autonomy. A machine simply cannot be created to do this. It needs to be able to empathize with humans. \r\n\r\nEmpathy is an important skill. Not all people are great at it, some people who lack the ability to empathize view that as a strength, and further view those who can empathize as being weak. Ultimately, I will argue that the ability to empathize with one another, and the world around us is what ultimately separates us from machines. However, due to the nature of empathy, it is almost impossible to quantitate. An individual simply cannot define their own sense of empathy, let alone try to measure or describe someone else's.\r\n\r\nI once fell in the camp of viewing empathy as a weakness. However, as I have learned more about the world, I have began to understand how flawed that view is. Changing your mind is hard, and oftentimes we don't even realize we've done it until we sit down to write a blog post that briefly discusses the topic at hand.\r\n\r\nAfter playing around with ChatGPT and the like, I began to change my mind once again. I've felt as though I've been very aware of the process and my change in mindset. It first started as, the thought of how great it will be to replace mundane and unethical jobs. \r\n\t\r\n>*(Note from C²: I realize this is going to be considered a hot-take by many, but work in retail for 2 days, especially as a woman, and realize that this is the unbridled truth)* \r\n\r\nThe fact that retail workers still exist to the extent that they do is unethical. The mere fact that customers and managers exist who are allowed to harass innocent employees to no end is quite frankly disgusting, and wholly unethical. The fact that we as a society generally don't see the need to take immediate action against (primarily) men harassing (especially in the case of young[er]) women (especially, but not limited to) verbally is horrifying.\r\n\r\nIt's disgusting and abhorrent that some men objectify women and discuss parts of them with others, regardless of their gender. If you so much as dare to not reciprocate this behaviour, or engage in it, you're quickly shunned. I've flat out been told on multiple occasions that it's \"not cool\" to act in a manner that doesn't objectify women into mere sex trophies.\r\n\r\nThis inevitably brings me to the desire to \"remove the human factor\" for all the wrong reasons. I had begun writing this intending to conclude that I want to \"remove the human factor\" for situations like driving, where thousands of people are needlessly *murdered* each year by negligence on behalf of themselves, others, and their governments.\r\n\r\nHowever, I now realize that I have some deep desire to escape from contact with the general public (I strongly believe) due to my experiences working in retail, and furthering that goal is something that \"removing the human factor\" will probably achieve. It seems my brain has once again played tricks on me to downplay my (admittedly relatively minor) traumas.\r\n\r\nI'd normally try to write a \"proper\" conclusion here, but this post has evolved from an attempt to document my thoughts into a realization that I can't fully grasp the reasoning behind any of my thoughts, but now I'm having an existential crisis and want to go to bed, so I will.\r\n\r\n> *(Note from C²: I feel like this ending has made me come off as one of those psychopaths that think humans need to go extinct. I don't believe that and that belief couldn't be further from the truth if it tried to be. I simply have the desire to hide away from society for a while.)*\r\n\r\n-C²\n",
				"date_published": "2023-04-20T20:59:32-05:00",
				"url": "https://www.sidpatchy.com/2023/04/20/removing-the-human.html"
			},
			{
				"id": "http://sidpatchy.micro.blog/2023/03/24/smartwatch-tier-list.html",
				
				"content_html": "<p><!-- raw HTML omitted -->Smartwatch tier list:<!-- raw HTML omitted --></p>\n<ol>\n<li>Pebble Time Steel</li>\n<li>Pebble Time Round</li>\n<li>OG Pebble</li>\n<li>Garmin Fenix 6</li>\n<li>Microsoft Band</li>\n<li>Garmin Vivosmart 4</li>\n<li>Literally an iPod strapped you your wrist</li>\n<li>Bangle.js 2</li>\n<li>Android Wear watches</li>\n<li>WearOS watches</li>\n<li>Fitbit Charge 5</li>\n<li>Fitbit Versa 3</li>\n</ol>\n<p>Haven&rsquo;t used an Apple Watch besides seeing them in demo mode at stores. I don&rsquo;t use an iPhone so I don&rsquo;t see that changing any time soon. From my first impressions though, I would say it&rsquo;d go just above #7.</p>\n",
				"content_text": "<u>Smartwatch tier list:</u>\r\n\r\n1. Pebble Time Steel\r\n2. Pebble Time Round\r\n3. OG Pebble\r\n4. Garmin Fenix 6\r\n5. Microsoft Band\r\n6. Garmin Vivosmart 4\r\n7. Literally an iPod strapped you your wrist\r\n8. Bangle.js 2\r\n9. Android Wear watches\r\n10. WearOS watches\r\n11. Fitbit Charge 5\r\n12. Fitbit Versa 3\r\n\r\nHaven't used an Apple Watch besides seeing them in demo mode at stores. I don't use an iPhone so I don't see that changing any time soon. From my first impressions though, I would say it'd go just above #7.\n",
				"date_published": "2023-03-24T22:54:48-05:00",
				"url": "https://www.sidpatchy.com/2023/03/24/smartwatch-tier-list.html"
			},
			{
				"id": "http://sidpatchy.micro.blog/2023/03/24/i-miss-pebble.html",
				"title": "i miss pebble",
				"content_html": "<p>The first smartwatch I ever used was the original Pebble, it was amazing. I used it for a few years until the zebra strip went bad. At that point I switched to Android Wear for about a year until I got fed up with it, so I bought a Pebble Time Steel.</p>\n<p>Eventually, I wasn&rsquo;t satisfied, I wanted fitness tracking so I bought a Fitbit. Worst watch I&rsquo;ve ever used. The only thing it has over any competitor is battery life, and even that sucks in comparison to my OG Pebble.</p>\n<p>Eventually I switched back to my time steel. One day however, I started having issues with bluetooth that I could never fix. So I switched to a Garmin Fenix 6X Pro Solar (awful naming scheme). The battery life is awesome. It&rsquo;s truly a joy to not have to charge my watch but once ever 2-3 weeks.</p>\n<p>I&rsquo;ve been with my Garmin for about year now. Today I started to do some spring cleaning and found my Pebble Time Steel again. I powered it on and it still had 50% of it&rsquo;s battery remaining, exactly how I left it. I fiddled with it for a while, then went back to cleaning.</p>\n<p>Even 11 years after the original Pebble was released, I still love it. It&rsquo;s miles ahead of modern competition, and the only company that comes anywhere remotely close is Garmin, but their developer community and software pales in comparison to Pebble, even as it stands today.</p>\n<p>I guess I&rsquo;m writing this because I&rsquo;m at another crossroads in my journey. I really like the fitness tracking provided by my Garmin, but it&rsquo;s software is not good enough. It&rsquo;s not intuitive, it&rsquo;s not responsive, and it just doesn&rsquo;t have the charm that my Pebble has.</p>\n<p>I know it&rsquo;s unreasonable, I know that&rsquo;s it&rsquo;s just a watch, but it feels like a member of my family. It&rsquo;s been through hell and back with me. I can&rsquo;t give it up. I won&rsquo;t give it up. It&rsquo;s in my sad memories and happy memories alike. Always there. Always ready to do its job with a pep to its step.</p>\n<p>I&rsquo;ve accepted that I will never get a replacement. There will never be another Pebble. I&rsquo;ve tried too many alternatives to recall them all. All I can do is keep my beloved Pebble working and take good care of it, as it has taken good care of me through years of neglect.</p>\n<p>I used to have pretty bad issues with panic attacks. The best solution I&rsquo;ve ever found to getting myself to calm down was an app called <a href=\"http://apps.rebble.io/en_US/application/583dc06f00355abe66000862?query=Breathe%C2%A7ion=watchapps\">Breathe</a>. I think that&rsquo;s part of why I&rsquo;m so attached to it.</p>\n<p>My Garmin has a similar feature but it doesn&rsquo;t work anywhere close to as well. It stops and wants to try to &ldquo;get a feel&rdquo; for your breathing. I don&rsquo;t need that. All I want is a guide.</p>\n<p>This has been all over the place. Sorry.</p>\n<p>My struggle is this:\nIs fitness tracking worth the tradeoff? Everything except battery life is worse, but I&rsquo;m a data-driven person. If I&rsquo;m going to make a change to my life, I <em>need</em> data to back up my choice. That&rsquo;s just how I am. I want both. I want it badly.</p>\n<p>I&rsquo;ve tried both. I used a Garmin Vivosmart 4 alongside my Pebble for a few months, but it ended up feeling silly. I just want a solution.</p>\n<p>This all feels silly to me; I hardly have an emotional attachment to anything, but I actually feel bad for leaving it to rot in a box full of other neglected watches. It doesn&rsquo;t deserve that. It&rsquo;s so much more than those are.</p>\n<p>Long store short, I&rsquo;ve decided to stick with my Garmin Fenix 6. That&rsquo;s all.</p>\n",
				"content_text": "The first smartwatch I ever used was the original Pebble, it was amazing. I used it for a few years until the zebra strip went bad. At that point I switched to Android Wear for about a year until I got fed up with it, so I bought a Pebble Time Steel.\n\nEventually, I wasn't satisfied, I wanted fitness tracking so I bought a Fitbit. Worst watch I've ever used. The only thing it has over any competitor is battery life, and even that sucks in comparison to my OG Pebble.\n\nEventually I switched back to my time steel. One day however, I started having issues with bluetooth that I could never fix. So I switched to a Garmin Fenix 6X Pro Solar (awful naming scheme). The battery life is awesome. It's truly a joy to not have to charge my watch but once ever 2-3 weeks.\n\nI've been with my Garmin for about year now. Today I started to do some spring cleaning and found my Pebble Time Steel again. I powered it on and it still had 50% of it's battery remaining, exactly how I left it. I fiddled with it for a while, then went back to cleaning.\n\nEven 11 years after the original Pebble was released, I still love it. It's miles ahead of modern competition, and the only company that comes anywhere remotely close is Garmin, but their developer community and software pales in comparison to Pebble, even as it stands today.\n\nI guess I'm writing this because I'm at another crossroads in my journey. I really like the fitness tracking provided by my Garmin, but it's software is not good enough. It's not intuitive, it's not responsive, and it just doesn't have the charm that my Pebble has.\n\nI know it's unreasonable, I know that's it's just a watch, but it feels like a member of my family. It's been through hell and back with me. I can't give it up. I won't give it up. It's in my sad memories and happy memories alike. Always there. Always ready to do its job with a pep to its step.\n\nI've accepted that I will never get a replacement. There will never be another Pebble. I've tried too many alternatives to recall them all. All I can do is keep my beloved Pebble working and take good care of it, as it has taken good care of me through years of neglect.\n\nI used to have pretty bad issues with panic attacks. The best solution I've ever found to getting myself to calm down was an app called [Breathe](http://apps.rebble.io/en_US/application/583dc06f00355abe66000862?query=Breathe§ion=watchapps). I think that's part of why I'm so attached to it.\n\nMy Garmin has a similar feature but it doesn't work anywhere close to as well. It stops and wants to try to \"get a feel\" for your breathing. I don't need that. All I want is a guide.\n\nThis has been all over the place. Sorry. \n\nMy struggle is this:\nIs fitness tracking worth the tradeoff? Everything except battery life is worse, but I'm a data-driven person. If I'm going to make a change to my life, I *need* data to back up my choice. That's just how I am. I want both. I want it badly.\n\nI've tried both. I used a Garmin Vivosmart 4 alongside my Pebble for a few months, but it ended up feeling silly. I just want a solution.\n\nThis all feels silly to me; I hardly have an emotional attachment to anything, but I actually feel bad for leaving it to rot in a box full of other neglected watches. It doesn't deserve that. It's so much more than those are.\n\nLong store short, I've decided to stick with my Garmin Fenix 6. That's all.\n",
				"date_published": "2023-03-24T21:04:05-05:00",
				"url": "https://www.sidpatchy.com/2023/03/24/i-miss-pebble.html"
			},
			{
				"id": "http://sidpatchy.micro.blog/2023/03/17/i-love-this.html",
				
				"content_html": "<p>I <em>love</em> this lens. Shot on Sony a6000 using a Canon 50mm f/1.4 lens I found on eBay from the 70s.</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "I *love* this lens. Shot on Sony a6000 using a Canon 50mm f/1.4 lens I found on eBay from the 70s.\n\n<img src=\"https://cdn.uploads.micro.blog/101940/2023/59e63774a8.jpg\" width=\"600\" height=\"400\" alt=\"Kitty\">\n",
				"date_published": "2023-03-17T06:49:27-05:00",
				"url": "https://www.sidpatchy.com/2023/03/17/i-love-this.html"
			},
			{
				"id": "http://sidpatchy.micro.blog/2023/03/05/all-your-spring.html",
				
				"content_html": "<p>All the posts I&rsquo;m seeing about spring finally being here are making me really envious&hellip;</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "All the posts I'm seeing about spring finally being here are making me really envious...\n\n<img src=\"https://cdn.uploads.micro.blog/101940/2023/257f3ae0e7.jpg\" width=\"451\" height=\"600\" alt=\"\">\n",
				"date_published": "2023-03-05T21:50:09-05:00",
				"url": "https://www.sidpatchy.com/2023/03/05/all-your-spring.html"
			},
			{
				"id": "http://sidpatchy.micro.blog/2023/03/03/my-pipe-dream.html",
				"title": "My 360⁰ Pipe Dream",
				"content_html": "<p>I&rsquo;m a bit of a hoarder when it comes to digital data. I have copies of everything I&rsquo;ve downloaded since 2016 sitting on a hard drive, why? Well, because I might need it <em>someday</em>! I have full backups of just about every computer I&rsquo;ve ever owned. And recently I&rsquo;ve taken to downloading websites that I find interesting because &ldquo;what if they shut down? How will I find them again?&rdquo;</p>\n<p>It&rsquo;s blatantly eating my money and time, but I love being able to go back and look at my old data, combing through the details of everything to make a narrative of what I was doing back then. Yes, journaling what I&rsquo;m doing in my digital life would be much simpler, but I love the challenge of investigating my past self&rsquo;s habits, and seeing how much I&rsquo;ve learned and changed.</p>\n<p>One day not too long ago I was reminiscing on one such backup, and a thought popped into my head that I haven&rsquo;t been able to get rid of: what if I had a 360⁰ camera recording <em>everything</em> I do? No matter how many times I try to remind myself of the practicalities of this, or, hell, the privacy issues alone, I can&rsquo;t get the thought out of my head.</p>\n<p>Think about it, you&rsquo;re having a conversation with a friend, they claim that you went to one restaurant for lunch on 2021-03-26, while you claim you went to a completely different place. Why argue? You could go back and check video for that day to see exactly what you did.</p>\n<p>A sort of this was explored in &ldquo;The Circle&rdquo; (2017), but I don&rsquo;t want it to be streamed to social media, that&rsquo;s weird and creepy (this will be an interesting quote to look back on in a few years, mark my words), I just want to have that information for my future self to reference.</p>\n<p>I don&rsquo;t think we&rsquo;re too far from having a version of this, Google Glass was surprisingly close, and now with tech giants racing to see who can bring useful AR glasses to market first, I think we&rsquo;ll have more recordings of our day-to-day lives than ever before.</p>\n<p>That being said, I don&rsquo;t think the techbro way is the correct way. Google doesn&rsquo;t need to have a recording of everything I do, though they probably already do, it&rsquo;s the thought of intentionally giving them that that hurts me.</p>\n<p>In conclusion, no, I won&rsquo;t be recording myself, even though I think it&rsquo;d be really cool, and no I don&rsquo;t intend to do so with AR glasses either.</p>\n",
				"content_text": "I'm a bit of a hoarder when it comes to digital data. I have copies of everything I've downloaded since 2016 sitting on a hard drive, why? Well, because I might need it *someday*! I have full backups of just about every computer I've ever owned. And recently I've taken to downloading websites that I find interesting because \"what if they shut down? How will I find them again?\"\n\nIt's blatantly eating my money and time, but I love being able to go back and look at my old data, combing through the details of everything to make a narrative of what I was doing back then. Yes, journaling what I'm doing in my digital life would be much simpler, but I love the challenge of investigating my past self's habits, and seeing how much I've learned and changed.\n\nOne day not too long ago I was reminiscing on one such backup, and a thought popped into my head that I haven't been able to get rid of: what if I had a 360⁰ camera recording *everything* I do? No matter how many times I try to remind myself of the practicalities of this, or, hell, the privacy issues alone, I can't get the thought out of my head. \n\nThink about it, you're having a conversation with a friend, they claim that you went to one restaurant for lunch on 2021-03-26, while you claim you went to a completely different place. Why argue? You could go back and check video for that day to see exactly what you did.\n\nA sort of this was explored in \"The Circle\" (2017), but I don't want it to be streamed to social media, that's weird and creepy (this will be an interesting quote to look back on in a few years, mark my words), I just want to have that information for my future self to reference.\n\nI don't think we're too far from having a version of this, Google Glass was surprisingly close, and now with tech giants racing to see who can bring useful AR glasses to market first, I think we'll have more recordings of our day-to-day lives than ever before.\n\nThat being said, I don't think the techbro way is the correct way. Google doesn't need to have a recording of everything I do, though they probably already do, it's the thought of intentionally giving them that that hurts me.\n\nIn conclusion, no, I won't be recording myself, even though I think it'd be really cool, and no I don't intend to do so with AR glasses either.\n",
				"date_published": "2023-03-03T12:14:40-05:00",
				"url": "https://www.sidpatchy.com/2023/03/03/my-pipe-dream.html"
			},
			{
				"id": "http://sidpatchy.micro.blog/2023/03/03/solitude-is-a.html",
				
				"content_html": "<p>Solitude is a late morning cup of tea.</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "Solitude is a late morning cup of tea.\n\n<img src=\"https://cdn.uploads.micro.blog/101940/2023/6fe4827038.jpg\" width=\"451\" height=\"600\" alt=\"\">\n",
				"date_published": "2023-03-03T12:02:56-05:00",
				"url": "https://www.sidpatchy.com/2023/03/03/solitude-is-a.html"
			},
			{
				"id": "http://sidpatchy.micro.blog/2023/03/03/my-favourite-word.html",
				
				"content_html": "<p>My favourite word in the dictionary is &ldquo;hidey-hole.&rdquo; That is all. I just think it&rsquo;s a silly word.</p>\n<p><a href=\"https://www.merriam-webster.com/dictionary/hidey-hole\">www.merriam-webster.com/dictionar&hellip;</a></p>\n",
				"content_text": "My favourite word in the dictionary is \"hidey-hole.\" That is all. I just think it's a silly word.\n\n[www.merriam-webster.com/dictionar...](https://www.merriam-webster.com/dictionary/hidey-hole)\n",
				"date_published": "2023-03-03T01:01:43-05:00",
				"url": "https://www.sidpatchy.com/2023/03/03/my-favourite-word.html"
			},
			{
				"id": "http://sidpatchy.micro.blog/2023/03/02/shot-on-fujifilm.html",
				
				"content_html": "<p>Shot on Fujifilm Superia 400 using my Canon AV-1 with a 50mm f/1.4 lens.</p>\n<p><!-- raw HTML omitted --><!-- raw HTML omitted --></p>\n",
				"content_text": "Shot on Fujifilm Superia 400 using my Canon AV-1 with a 50mm f/1.4 lens.\n\n<img src=\"https://sidpatchy.micro.blog/uploads/2023/f12aeba5d5.jpg\" width=\"397\" height=\"600\" alt=\"\"><img src=\"https://sidpatchy.micro.blog/uploads/2023/e75042a0d0.jpg\" width=\"600\" height=\"397\" alt=\"\">\n",
				"date_published": "2023-03-02T22:26:18-05:00",
				"url": "https://www.sidpatchy.com/2023/03/02/shot-on-fujifilm.html"
			},
			{
				"id": "http://sidpatchy.micro.blog/2023/03/02/protecting-against-the.html",
				"title": "Protecting Against the Future of Scamming",
				"content_html": "<p><em>(Note from C²: This post contains no AI generated content.)</em></p>\n<p>We live in a time of great technological progress. Conversational AI has finally left the niche and entered the view of the general public through ChatGPT and Bing.</p>\n<p>In addition to this, we&rsquo;re quickly reaching a point where deepfaking voices is becoming terrifyingly easy. I&rsquo;ve attempted creating deepfakes of myself and a few consenting friends and had decent results with as little as 5 seconds of sample audio.</p>\n<p>That leads us to the future of scamming. Where we&rsquo;re going, and what we can do to protect ourselves and those close to us.</p>\n<h1 id=\"scenario\">Scenario</h1>\n<hr>\n<p>The following story is just that, a story. It&rsquo;s not based on an actual event. Purely on a theory of our future that could be completely wrong. It is written from the perspective of the victim to assist you in learning what to look out for.</p>\n<p>This hypothetical scam is an evolution of the well documented <a href=\"https://consumer.ftc.gov/consumer-alerts/2021/04/dont-open-your-door-grandparent-scams\">Grandparent Scam</a>.</p>\n<p>The key difference from traditional Grandparent Scams is that the scammer obtains a voice sample from someone close to the victim. Be it from a video uploaded to social media, or by a phone-call to the subject. The scammer then uses this sample to create a realistic voice model that is in turn used to impersonate the subject.</p>\n<h2 id=\"the-parent\">The Parent.</h2>\n<p>You&rsquo;re woken up in the middle of the night by a series of text messages from an unfamiliar phone number. They&rsquo;re claiming to be your daughter, she&rsquo;s recently gone on a trip to <em>a far away land</em>. She says that she&rsquo;s been arrested and needs money to get out right away.</p>\n<p>You&rsquo;ve heard of scams similar to this before, so you ask, &ldquo;Why aren&rsquo;t you using your phone?&rdquo;</p>\n<p>She responds &ldquo;They took it away! I&rsquo;ll call you.&rdquo;</p>\n<p>Your phone starts ringing, and you answer, it sounds just like your daughter, maybe a little different, but she&rsquo;s panicked and using a different phone, so it&rsquo;s only to be expected. At this point, all skepticism has left your mind. You truly believe this is your daughter.</p>\n<p>After some back and forth discussion, she again asks for money, and you, <strong>without suspecting anything</strong>, send it over, and wish her best of luck.</p>\n<p><em>unbeknownst to you, at this point, your money is <strong>gone</strong>. you have almost no chance of getting it back</em>.</p>\n<p>It is at this time, that you hop on social media to see if you can find any clues as to what happened. You notice that she posted a picture while you were on the phone. She&rsquo;s on a beach with her friends.</p>\n<p>You attempt to call phone number back, but no one answers. With no luck on that front, you call your daughter&rsquo;s normal phone number. She picks up, wondering why you sound panicked, and why you&rsquo;re asking about her getting arrested. <strong>She has no clue what you&rsquo;re talking about.</strong> You explain what happened and you both ultimately conclude that it was a scam.</p>\n<p>If you&rsquo;ve lost money to a scam like this, it was a crime. Report it to your local law enforcement agency.</p>\n<p>It&rsquo;s important to remember that you aren&rsquo;t stupid or gullible for falling victim to a scam. Scammers prey on our emotions and exploit them to their fullest potential in order to manipulate us. That is why we must learn how to recognize scams.</p>\n<h1 id=\"protecting-ourselves\">Protecting Ourselves</h1>\n<hr>\n<p>There are many methods we can use to differentiate scammers from those close to us. It&rsquo;s important that you not only rely on methods mentioned here, but also do research on other types of scams and their defenses, the defenses listed here are not suitable for defending against all types of scams.</p>\n<h2 id=\"passwords\">Passwords.</h2>\n<p>I don&rsquo;t mean a password for your accounts. I mean a password for your family. That way, if anyone ever runs into a scenario where you need to verify someone&rsquo;s identity, you can just ask for the password.</p>\n<p>Your password could be something as simple as details on a shared experience you had, or something more complex like a phrase. Something like &ldquo;praise-golf-asparagus&rdquo;. You can use this <a href=\"https://bitwarden.com/password-generator/\">tool from Bitwarden</a> to generate passphrases.</p>\n<p>No matter what you choose, it&rsquo;s important that you never discuss this password with anyone outside your family or post it online. If a scammer is able to get ahold of your password and exploit it, it is worse than not having one.</p>\n<h2 id=\"callback\">Callback.</h2>\n<p>If you get a call from a family member&rsquo;s phone number, tell them you need to call them back and hang up. Then, dial their phone number yourself. This ensures that you are speaking to the actual owner of the phone number and not a spoofed number.</p>\n<p>This has the weakness of being vulnerable to <a href=\"https://consumer.ftc.gov/consumer-alerts/2019/10/sim-swap-scams-how-protect-yourself\">SIM swap</a> attacks though. So using additional methods is a good idea.</p>\n<h2 id=\"video\">Video.</h2>\n<p>We&rsquo;re still quite a ways off being able to deepfake someone&rsquo;s face in real time. Use this to your advantage. If you&rsquo;re still unsure after validating your family password, make them join a video call. If they won&rsquo;t, don&rsquo;t trust them.</p>\n<h2 id=\"ponder\">Ponder.</h2>\n<p>Always be wary of urgent requests. Scammers use urgency to place massive amounts of pressure on their victims. If someone claims they need money, or personal information right away, it&rsquo;s important to take a step back and ponder their request.</p>\n",
				"content_text": "*(Note from C²: This post contains no AI generated content.)*\n\nWe live in a time of great technological progress. Conversational AI has finally left the niche and entered the view of the general public through ChatGPT and Bing. \n\nIn addition to this, we're quickly reaching a point where deepfaking voices is becoming terrifyingly easy. I've attempted creating deepfakes of myself and a few consenting friends and had decent results with as little as 5 seconds of sample audio.\n\nThat leads us to the future of scamming. Where we're going, and what we can do to protect ourselves and those close to us.\n\n# Scenario\n---\nThe following story is just that, a story. It's not based on an actual event. Purely on a theory of our future that could be completely wrong. It is written from the perspective of the victim to assist you in learning what to look out for.\n\nThis hypothetical scam is an evolution of the well documented [Grandparent Scam](https://consumer.ftc.gov/consumer-alerts/2021/04/dont-open-your-door-grandparent-scams).\n\nThe key difference from traditional Grandparent Scams is that the scammer obtains a voice sample from someone close to the victim. Be it from a video uploaded to social media, or by a phone-call to the subject. The scammer then uses this sample to create a realistic voice model that is in turn used to impersonate the subject.\n\n## The Parent.\nYou're woken up in the middle of the night by a series of text messages from an unfamiliar phone number. They're claiming to be your daughter, she's recently gone on a trip to *a far away land*. She says that she's been arrested and needs money to get out right away.\n\nYou've heard of scams similar to this before, so you ask, \"Why aren't you using your phone?\"\n\nShe responds \"They took it away! I'll call you.\"\n\nYour phone starts ringing, and you answer, it sounds just like your daughter, maybe a little different, but she's panicked and using a different phone, so it's only to be expected. At this point, all skepticism has left your mind. You truly believe this is your daughter.\n\nAfter some back and forth discussion, she again asks for money, and you, **without suspecting anything**, send it over, and wish her best of luck.\n\n*unbeknownst to you, at this point, your money is **gone**. you have almost no chance of getting it back*.\n\nIt is at this time, that you hop on social media to see if you can find any clues as to what happened. You notice that she posted a picture while you were on the phone. She's on a beach with her friends. \n\nYou attempt to call phone number back, but no one answers. With no luck on that front, you call your daughter's normal phone number. She picks up, wondering why you sound panicked, and why you're asking about her getting arrested. **She has no clue what you're talking about.** You explain what happened and you both ultimately conclude that it was a scam.\n\nIf you've lost money to a scam like this, it was a crime. Report it to your local law enforcement agency. \n\nIt's important to remember that you aren't stupid or gullible for falling victim to a scam. Scammers prey on our emotions and exploit them to their fullest potential in order to manipulate us. That is why we must learn how to recognize scams.\n\n# Protecting Ourselves\n---\nThere are many methods we can use to differentiate scammers from those close to us. It's important that you not only rely on methods mentioned here, but also do research on other types of scams and their defenses, the defenses listed here are not suitable for defending against all types of scams.\n\n## Passwords.\nI don't mean a password for your accounts. I mean a password for your family. That way, if anyone ever runs into a scenario where you need to verify someone's identity, you can just ask for the password.\n\nYour password could be something as simple as details on a shared experience you had, or something more complex like a phrase. Something like \"praise-golf-asparagus\". You can use this [tool from Bitwarden](https://bitwarden.com/password-generator/) to generate passphrases.\n\nNo matter what you choose, it's important that you never discuss this password with anyone outside your family or post it online. If a scammer is able to get ahold of your password and exploit it, it is worse than not having one.\n\n## Callback.\nIf you get a call from a family member's phone number, tell them you need to call them back and hang up. Then, dial their phone number yourself. This ensures that you are speaking to the actual owner of the phone number and not a spoofed number.\n\nThis has the weakness of being vulnerable to [SIM swap](https://consumer.ftc.gov/consumer-alerts/2019/10/sim-swap-scams-how-protect-yourself) attacks though. So using additional methods is a good idea.\n\n## Video.\nWe're still quite a ways off being able to deepfake someone's face in real time. Use this to your advantage. If you're still unsure after validating your family password, make them join a video call. If they won't, don't trust them.\n\n## Ponder.\nAlways be wary of urgent requests. Scammers use urgency to place massive amounts of pressure on their victims. If someone claims they need money, or personal information right away, it's important to take a step back and ponder their request.\n",
				"date_published": "2023-03-02T17:15:30-05:00",
				"url": "https://www.sidpatchy.com/2023/03/02/protecting-against-the.html"
			}
	]
}
